app/controllers/fav_fonts_controller.rb

  def destroy
    FavFont.destroy(params[:id])
    font = FavFont.find(params[:id])
---
SELECT  "fav_fonts".* FROM "fav_fonts" WHERE "fav_fonts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]