app/controllers/fav_fonts_controller.rb

  def set_profile
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    fav_font = FavFont.new(fav_fonts_params)
    fav_font.user_id = @user.id #if @user

    if fav_font.save
---
INSERT INTO "fav_fonts" ("font_family", "user_id", "created_at", "updated_at", "category", "origin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["font_family", "Abel"], ["user_id", 1], ["created_at", 2016-11-03 17:02:41 UTC], ["updated_at", 2016-11-03 17:02:41 UTC], ["category", "sans-serif"], ["origin", "google"]]

  def index
    fonts = FavFont.all
---
SELECT "fav_fonts".* FROM "fav_fonts"

  def destroy
    FavFont.destroy(params[:id])
---
DELETE FROM "fav_fonts" WHERE "fav_fonts"."id" = $1  [["id", 1]]

  def allfonts
    topass = {}
    y = 0
    FavFont.all.each do |x|
---
SELECT "fav_fonts".* FROM "fav_fonts"