app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_profile
    @user = User.find(params[:id])

INSERT INTO "users" ("username", "email_address", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$ziSI/Q7kO1snhdM.e9PJ3.zqCAo171FAdLZElW5KhgzsqGZAj8.bq"], ["updated_at", 2016-11-04 01:44:33 UTC], ["id", 3]]
---
  def update
    @user.update(user_params)